[{
  "id": 5,
  "projectName": "Wealth Wing",
  "github": "https://github.com/WealthWing/wealth-wing-frontend",
  "link": "https://wealth-wing.netlify.app/",
  "info": "Wealth Wing is a personal finance app to track accounts, transactions, subscriptions, and budgets. Users can import CSVs from banks, categorize spending, and view monthly/quarterly summaries (net, in/out, median spend). Supports multi-organization and role-based access for teams. No AI/RAG features.",
  "developed_at": "",
  "demo": "",
  "images": [
    {
      "image_id": "projects/Screenshot_2025-09-07_at_3.11.05_PM_x9y1qw",
      "description": "Dashboard with accounts, income vs spend, and recent transactions."
    },
    {
      "image_id": "projects/ww-transactions_yrs4ja",
      "description": "Transactions table with filters, categories, and CSV import status."
    }
  ],
  "techologies": [
    "react",
    "typescript",
    "emotion",
    "fastapi",
    "sqlalchemy",
    "redux",
    "postgresql"
  ]
},
  {
    "id": 1,
    "demo": "",
    "developed_at": "",
    "github": "https://github.com/shazy89/portfolio",
    "info": "A modern personal portfolio built with Gatsby, TypeScript, and Emotion, fully designed in Figma. The site highlights my latest and past projects, each with descriptions and GitHub links for code access. It also includes quick links to my social platforms, making it easy to connect and explore my work.",
    "link": "https://edshaziman.com/",
    "projectName": "Portfolio Website",
    "images": [
      {
        "image_id": "projects/Screen_Shot_2022-12-26_at_7.20.34_AM_uxxnui",
        "description": "The heading screen, with yellow frame borders, lefts side includes the social media links, next to the links Ed Shazimans image and the right to the nav bar and below the navbar intro."
      },
      {
        "image_id": "projects/Screen_Shot_2022-12-26_at_7.20.46_AM_gfaloe",
        "description": "Portfolio section, the image includes left and right clickable arrows positioned to the left and right of the picture. The idea has two parts. The left side of the page contains two images about the project, and the right side project description and clickable links."
      }
    ],
    "techologies": [
      "react",
      "gatsby-js",
      "javascript",
      "emotion",
      "typescript",
      "html"
    ]
  },
  {
    "id": 2,
    "projectName": "Culina",
    "github": "https://github.com/shazy89/culina-dashboard",
    "link": "https://culina.website/",
    "info": "Dashboard of a Saas construction App. Admin users can add new companies and manage current companies. Each company can have employee users added to them. Projects and work orders can be created to track ongoing work. Charts are displayed to show revenue, total employee count, total user count, and total project data. <br/>A small portion of this app is finished, and more is to come. Clients will be able to track the company trucks, and the shared tools also will have a preview of what materials the track has and what materials are picked up from the warehouse daily <br/><br/> Culina is a MERN stack app and is a practice project. It's not being used in the real world.",
    "developed_at": "",
    "demo": "https://www.youtube.com/watch?v=yfwoDKNhJQg&list=PL0zbnzgKNis1xNPhk3jmGx_KhQgK1SzaS&index=13",
    "images": [
      {
        "image_id": "projects/Screen_Shot_2021-06-30_at_7.16.01_PM_pzqi1o",
        "description": "culina dashboard page includes info about the clients, users, pojects and dynamic charts"
      },
      {
        "image_id": "projects/Screen_Shot_2021-06-30_at_7.16.26_PM_nxervm",
        "description": "Culina, clients page. Includes data about the client, employees, and projects"
      }
    ],
    "techologies": [
      "javascript",
      "react",
      "redux",
      "html",
      "mongo",
      "css",
      "sass"
    ]
  },
  {
    "id": 3,
    "projectName": "RentMe",
    "github": "https://github.com/shazy89/RentMe-mobile",
    "link": "",
    "info": "Car rental app featuring multiple cars, customizable dates, schedule and manage bookings that will calculate the fare for customers. Admin has the ability to manage the cars, upload images for new car postings, and review booking metrics reports. <br/><br/>RentMe is (SPA) car rental app where users can search for available cars on selected dates, check for prices and schedule a booking. Admin users can use tools for creating new available cars, edit listings, upload images to listings and view reports on bookings.<br/><br/>The Backend uses Ruby on Rails with PostgreSQL, and Frontend is handled using React.",
    "developed_at": "",
    "demo": "https://www.youtube.com/embed/dZjlMhitkwc",
    "images": [
      {
        "image_id": "projects/rm1_dpkrja",
        "description": "rent me available cars page"
      },
      {
        "image_id": "projects/rm3_vgeuvx.png",
        "description": "rent me form page"
      }
    ],
    "techologies": [
      "javascript",
      "react",
      "redux",
      "html",
      "css",
      "ruby-rails",
      "postgresql"
    ]
  }
]